zprotoc/jsonnet/README.org
* Model Taxonomy

Before we model, we must model the model.  Our eventual model is a
data structure which follows a particular object schema.  That data
structure will eventually describes all the parts that go into a
"protocol endpoint" and so the schema it follows is described in term
of the "taxonomy of protocol endpoints".  We don't know what the heck
a "taxonomy of protocol endpoints" is, but that shouldn't stop us from
creating it.

But, first we must say that the data structure which is our model will
be rather annoying to write out in long hand.  Thus we will model our
model in Jsonnet.  So this section is really modeling a model of our
model.  This is of course ridiculous (despite being true).  To keep it
simple, moo gives us some Jsonnet functions and data structures to use
when constructing model that forces the resulting data structure to be
well formed.  In fact, it is these functions that define the schema
which our templates must finally honor.


** Basic types

Eventually our model will be applied a template to generate code.
Most code needs to include some type names so we must be able to name
types.  In moo we do that like:

#+begin_src jsonnet
  local lang = import "moo/cpp.jsonnet";
  lang.types.string
#+end_src

Which returns:

#+begin_src c++
  "std::string"
#+end_src

A moo type is simply the name of some type in the target programming
language stored in a Jsonnet variable which itself evokes the type
name.  The Jsonnet variable name is consistent across all target
variables.  Eg,

#+begin_src jsonnet
  local lang = import "moo/python.jsonnet";
  lang.types.string
#+end_src

Returns

#+begin_src c++
  "str"
#+end_src

There are similar basic types defined for all your plain-old-data
needs.  If any are missing, well, we can add them.  

But, before we leave basic types there is one type which is not a type
and that is ~notype~ which in C++ gives our friend, ~void~.

** Attributes

It is sometimes not enough to simply name a type and we often must
name a thing.  A named thing in moo is an attribute.  An attribute of
what?  Who knows? (Well, we do, but we do not yet say).

#+begin_src jsonnet
  local moo = import "moo.jsonnet";
  local lang = import "moo/cpp.jsonnet";
  moo.attribute("color", lang.types.string, "purple")
#+end_src

Returns:

#+begin_src json
{
   "def": "purple",
   "name": "color",
   "type": "std::string"
}
#+end_src

So, an attribute has a type, a name and a default (~"def"~) value of the
given type.  It is fun to talk about one attribute here and one
attribute there but sometimes we want more than one.  When we have
many attributes we simply have an array of attribute.

#+begin_src jsonnet
  local moo = import "moo.jsonnet";
  local lang = import "moo/cpp.jsonnet";
  [
    moo.attribute("color", lang.types.string, "purple"),
    moo.attribute("count", lang.types.integer, 0),
  ]
#+end_src

This compiles to:

#+begin_src json
  [
     {
        "def": "purple",
        "name": "color",
        "type": "std::string"
     },
     {
        "def": 0,
        "name": "count",
        "type": "int"
     }
  ]
#+end_src

These JSON examples are getting long and already Jsonnet's brevity is
being appreciated.

** Object

Our next scale up in complexity is on the one hand rather simple.  We
combine a "name" with some attributes and call it an "object".  The
"name" we will interpret kind of like a type.

In fact, in some cases, we interpret it exactly like a type.  Some
templates will generate a target language ~struct~ or ~class~ type from a
model object.  Others will generate a message schema or generate code
that can make messages where the "name" is held by the message as a
type identifier.

We will also add an optional element of ~object~ which is a brief
documentation string called ~help~.

#+begin_src jsonnet
  local moo = import "moo.jsonnet";
  local lang = import "moo/cpp.jsonnet";
  moo.object("candies", [
    moo.attribute("color", lang.types.string, "purple"),
    moo.attribute("count", lang.types.integer, 0),
  ], "A container full of yumminess")
#+end_src

We'll omit the JSON as it's no long exciting to see all those curly
braces and quotes.  The JSON object representation of ~object~ is not
particularly important until we learn about writing templates but
~.name~ givs us the name, ~.attrs~ gives the array of attributes and ~.help~
gives us the help string.

Let's think more about our ~object~.  It models a compound of types and
has a name that is kind of a type, but not really.  The name just
identifies the type.  The ~object~ as a whole is the type.  Just like in
C++ the ~struct~ name is not a type it just names a type.  Okay, so then
shouldn't we be able to make an object with attributes that are
themselves objects?  Let's not ask for permission.  Let's just do it:

#+begin_src jsonnet
  local moo = import "moo.jsonnet";
  local lang = import "moo/cpp.jsonnet";
  local candies = moo.object("candies", [
      moo.attribute("color", lang.types.string, "purple"),
      moo.attribute("count", lang.types.integer, 0),
  ]);
  moo.object("eat", [
      moo.attribute("snack", candies),
  ])
#+end_src

Well, that at least compiles to JSON.  We omitted the "help" for
brevity.  We also did not give a default value for the ~"eat"~ object
which holds a single ~attribute~ which is an ~object~.  What sort of
default can we give since we are modeling and not generating code?
The answer is none, so we give none.  Templates that use the model can
still make a default from an ~object~ as each attribute (which isn't an
~object~) provide a default.

