moo/jsonnet/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-30 Thu 15:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
</head>
<body>
<div id="content">
<div id="outline-container-org2e5892c" class="outline-2">
<h2 id="org2e5892c"><span class="section-number-2">1</span> Model Taxonomy</h2>
<div class="outline-text-2" id="text-1">
<p>
Before we model, we must model the model.  Our eventual model is a
data structure which follows a particular object schema.  That data
structure will eventually describes all the parts that go into a
"protocol endpoint" and so the schema it follows is described in term
of the "taxonomy of protocol endpoints".  We don't know what the heck
a "taxonomy of protocol endpoints" is, but that shouldn't stop us from
creating it.
</p>

<p>
But, first we must say that the data structure which is our model will
be rather annoying to write out in long hand.  Thus we will model our
model in Jsonnet.  So this section is really modeling a model of our
model.  This is of course ridiculous (despite being true).  To keep it
simple, moo gives us some Jsonnet functions and data structures to use
when constructing model that forces the resulting data structure to be
well formed.  In fact, it is these functions that define the schema
which our templates must finally honor.
</p>
</div>


<div id="outline-container-org1179768" class="outline-3">
<h3 id="org1179768"><span class="section-number-3">1.1</span> Basic types</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Eventually our model will be applied a template to generate code.
Most code needs to include some type names so we must be able to name
types.  In moo we do that like:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> lang = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo/cpp.jsonnet"</span>;
lang.types.string
</pre>
</div>

<p>
Which returns:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e9b96e;">"std::string"</span>
</pre>
</div>

<p>
A moo type is simply the name of some type in the target programming
language stored in a Jsonnet variable which itself evokes the type
name.  The Jsonnet variable name is consistent across all target
variables.  Eg,
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> lang = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo/python.jsonnet"</span>;
lang.types.string
</pre>
</div>

<p>
Returns
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e9b96e;">"str"</span>
</pre>
</div>

<p>
There are similar basic types defined for all your plain-old-data
needs.  If any are missing, well, we can add them.  
</p>

<p>
But, before we leave basic types there is one type which is not a type
and that is <code>notype</code> which in C++ gives our friend, <code>void</code>.
</p>
</div>
</div>

<div id="outline-container-orga90492f" class="outline-3">
<h3 id="orga90492f"><span class="section-number-3">1.2</span> Attributes</h3>
<div class="outline-text-3" id="text-1-2">
<p>
It is sometimes not enough to simply name a type and we often must
name a thing.  A named thing in moo is an attribute.  An attribute of
what?  Who knows? (Well, we do, but we do not yet say).
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> moo = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> lang = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo/cpp.jsonnet"</span>;
moo.attribute(<span style="color: #e9b96e;">"color"</span>, lang.types.string, <span style="color: #e9b96e;">"purple"</span>)
</pre>
</div>

<p>
Returns:
</p>

<div class="org-src-container">
<pre class="src src-json">{
   <span style="color: #b4fa70;">"def"</span>: <span style="color: #e9b96e;">"purple"</span>,
   <span style="color: #b4fa70;">"name"</span>: <span style="color: #e9b96e;">"color"</span>,
   <span style="color: #b4fa70;">"type"</span>: <span style="color: #e9b96e;">"std::string"</span>
}
</pre>
</div>

<p>
So, an attribute has a type, a name and a default (<code>"def"</code>) value of the
given type.  It is fun to talk about one attribute here and one
attribute there but sometimes we want more than one.  When we have
many attributes we simply have an array of attribute.
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> moo = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> lang = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo/cpp.jsonnet"</span>;
[
  moo.attribute(<span style="color: #e9b96e;">"color"</span>, lang.types.string, <span style="color: #e9b96e;">"purple"</span>),
  moo.attribute(<span style="color: #e9b96e;">"count"</span>, lang.types.integer, 0),
]
</pre>
</div>

<p>
This compiles to:
</p>

<div class="org-src-container">
<pre class="src src-json">[
   {
      <span style="color: #b4fa70;">"def"</span>: <span style="color: #e9b96e;">"purple"</span>,
      <span style="color: #b4fa70;">"name"</span>: <span style="color: #e9b96e;">"color"</span>,
      <span style="color: #b4fa70;">"type"</span>: <span style="color: #e9b96e;">"std::string"</span>
   },
   {
      <span style="color: #b4fa70;">"def"</span>: <span style="color: #e9b2e3;">0</span>,
      <span style="color: #b4fa70;">"name"</span>: <span style="color: #e9b96e;">"count"</span>,
      <span style="color: #b4fa70;">"type"</span>: <span style="color: #e9b96e;">"int"</span>
   }
]
</pre>
</div>

<p>
These JSON examples are getting long and already Jsonnet's brevity is
being appreciated.
</p>
</div>
</div>

<div id="outline-container-org91d8814" class="outline-3">
<h3 id="org91d8814"><span class="section-number-3">1.3</span> Object</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Our next scale up in complexity is on the one hand rather simple.  We
combine a "name" with some attributes and call it an "object".  The
"name" we will interpret kind of like a type.
</p>

<p>
In fact, in some cases, we interpret it exactly like a type.  Some
templates will generate a target language <code>struct</code> or <code>class</code> type from a
model object.  Others will generate a message schema or generate code
that can make messages where the "name" is held by the message as a
type identifier.
</p>

<p>
We will also add an optional element of <code>object</code> which is a brief
documentation string called <code>help</code>.
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> moo = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> lang = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo/cpp.jsonnet"</span>;
moo.object(<span style="color: #e9b96e;">"candies"</span>, [
  moo.attribute(<span style="color: #e9b96e;">"color"</span>, lang.types.string, <span style="color: #e9b96e;">"purple"</span>),
  moo.attribute(<span style="color: #e9b96e;">"count"</span>, lang.types.integer, 0),
], <span style="color: #e9b96e;">"A container full of yumminess"</span>)
</pre>
</div>

<p>
We'll omit the JSON as it's no long exciting to see all those curly
braces and quotes.  The JSON object representation of <code>object</code> is not
particularly important until we learn about writing templates but
<code>.name</code> givs us the name, <code>.attrs</code> gives the array of attributes and <code>.help</code>
gives us the help string.
</p>

<p>
Let's think more about our <code>object</code>.  It models a compound of types and
has a name that is kind of a type, but not really.  The name just
identifies the type.  The <code>object</code> as a whole is the type.  Just like in
C++ the <code>struct</code> name is not a type it just names a type.  Okay, so then
shouldn't we be able to make an object with attributes that are
themselves objects?  Let's not ask for permission.  Let's just do it:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> moo = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> lang = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo/cpp.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> candies = moo.object(<span style="color: #e9b96e;">"candies"</span>, [
    moo.attribute(<span style="color: #e9b96e;">"color"</span>, lang.types.string, <span style="color: #e9b96e;">"purple"</span>),
    moo.attribute(<span style="color: #e9b96e;">"count"</span>, lang.types.integer, 0),
]);
moo.object(<span style="color: #e9b96e;">"eat"</span>, [
    moo.attribute(<span style="color: #e9b96e;">"snack"</span>, candies),
])
</pre>
</div>

<p>
Well, that at least compiles to JSON.  We omitted the "help" for
brevity.  We also did not give a default value for the <code>"eat"</code> object
which holds a single <code>attribute</code> which is an <code>object</code>.  What sort of
default can we give since we are modeling and not generating code?
The answer is none, so we give none.  Templates that use the model can
still make a default from an <code>object</code> as each attribute (which isn't an
<code>object</code>) provide a default.
</p>
</div>
</div>
