zprotoc/jsonnet/README.org
** Method

We say a "method" is a function called on an associated "instance".
The call possibly has some arguments, each of a type and possibly
returns a value of a type.  

In moo we could model a ~method~ similar to an ~object~.  The ~name~ of the
~object~ could be the name of the method, the attributes of the object
could be the arguments.  

But whence the return value and type?  We could model the ~method~ as an
attribute.  Then we have the name, and the return value and type.
But, now we've lost arguments (I hate losing arguments).

We could make a special attribute of an ~object~ describe the return
type but that feels too invasive and level smashing (I hate layer
smashing).

So we make a new model for a method which smooshes the two together.
But we still note that the resulting ~method~ data structure looks a
whole lot like an ~attribute~ or an ~object~.

#+begin_src jsonnet
  local moo = import "moo.jsonnet";
  local lang = import "moo/cpp.jsonnet";
  moo.method("open", lang.types.boolean, false, [
      moo.attribute("door", lang.types.string),
      moo.attribute("code", lang.types.integer, 1234)],
             "Open a door with a code, return true if successful")
#+end_src

We also see that the beauty of a ~method~ is, at best, skin deep.
Except for the parts in ~lang~ which are target-language-specific, we
have no way to specify the "guts" of the method.  If there are any
guts to serve at all, it is up to the templates to do that carving.

** State Machine

The next model type is itself its own little world as moo has for
modeling (hierarchical) finite state machines (FSM - not flying
spaghetti monster).  If you do not know what FSMs are, go read
[[https://en.wikipedia.org/wiki/Finite-state_machine][wikipedia]].  Go on, I'll wait.

Back already?  Fascinating stuff, wasn't it.  As you learned, FSMs
have a few interrelated parts and thus their modeling requires a few
interrelated models.  

SM are important to the great protocol endpoint taxonomy that we
endeavor to one day define.  As programmers, we write SMs all the time
without knowing it.  On the street they are called "an ugly mess of
if/then/else and sometimes goto".  But in the pristine halls of
academia (if I was still allowed in) we come up with names for messes
and call it science.  So, "hierarchical finite state machine" it is.
And, in fairness, modeling the mess of branching we ultimately always
need gives us an excellent way to disentangle that mess and approach
something that might resemble beauty.

In moo we already know all the models we need to construct a model of
an FSM.  Here are the

- event :: ~object~ 
- guard :: ~method~ (returning boolean)
- action :: ~method~ (returning null)
- state :: ~object~ (likely devoid of attributes)
- transition :: two states and optional event, guards and actions
- context :: ~object~ some contextual data accessible to guards and actions and the larger context calling the state machine
- machine :: ~object~ with at least one attribute named ~tt~ holding array of transitions and a ~context~ attribute.  A machine may also be used where a state is used and that's what lets us use the fancy word "hierarchical".


#+begin_src jsonnet
  local moo = import "moo.jsonnet";
  local lang = import "moo/cpp.jsonnet";
  local string = lang.types.string;
  local boolean = lang.types.boolean;
  // events
  local start = moo.object("start", [moo.attribute("greeting", string, '""')]);
  local quit = moo.object("quit");
  // states
  local ini = moo.object("initializing");
  local wrk = moo.object("working");
  local fin = moo.object("finalizing");
  // guards
  local awake = moo.method("check_awake", boolean, false);
  local happy = moo.method("check_happy", boolean, false);
  // actions
  local dowork = moo.method("dig_that_hole", lang.types.notype);
  // transition table
  local tt = [
      moo.transition(ini,wrk,start,[awake,happy],[dowork]),
      moo.transition(wrk,fin,quit)
  ];
  local ctx = moo.object("gear", [ moo.attribute("lunch", string, '"sandwich"'),
                                   moo.attribute("tool", string, '"hammer"') ]);
  local worksm = moo.object("work", [ moo.attribute("tt", tt),
                                      moo.attribute("context", ctx) ]);
  worksm
#+end_src

Modeling FSMs in moo requires embracing some caveats.  Ultimately the
FSM implementation depends on how the template interprets the model.
This is true for all moo models and templates but it's extra true for
FSMs.  The FSM model may turn into a nest of ~if/then/else~ branches or
the use of the ~tt~ may turn into a literal lookup into a transition
table.  The instance of the ~context~ model may be explicitly passed
into guards and actions or it may be "global".  In a likewise or
different fashion the current event instance may be made available to
these methods.  When we model the FSM we must know what data can be
shared between the FSM parts but the model doesn't specify how it is
shared, or even that it is shared, the template does.  

This unfortunately produces a conceptual cycle between the model and
the template.  Your humble author apologizes but I squeak a defense
that to further specify the FSM in the model would limit how it may be
implemented to the extent that the model would hold implementation
code and break my promise that modeling does not require programming.

