moo/jsonnet/README.html

<div id="outline-container-orgf71ca13" class="outline-3">
<h3 id="orgf71ca13"><span class="section-number-3">1.4</span> Method</h3>
<div class="outline-text-3" id="text-1-4">
<p>
We say a "method" is a function called on an associated "instance".
The call possibly has some arguments, each of a type and possibly
returns a value of a type.  
</p>

<p>
In moo we could model a <code>method</code> similar to an <code>object</code>.  The <code>name</code> of the
<code>object</code> could be the name of the method, the attributes of the object
could be the arguments.  
</p>

<p>
But whence the return value and type?  We could model the <code>method</code> as an
attribute.  Then we have the name, and the return value and type.
But, now we've lost arguments (I hate losing arguments).
</p>

<p>
We could make a special attribute of an <code>object</code> describe the return
type but that feels too invasive and level smashing (I hate layer
smashing).
</p>

<p>
So we make a new model for a method which smooshes the two together.
But we still note that the resulting <code>method</code> data structure looks a
whole lot like an <code>attribute</code> or an <code>object</code>.
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> moo = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> lang = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo/cpp.jsonnet"</span>;
moo.method(<span style="color: #e9b96e;">"open"</span>, lang.types.boolean, <span style="color: #e9b2e3;">false</span>, [
    moo.attribute(<span style="color: #e9b96e;">"door"</span>, lang.types.string),
    moo.attribute(<span style="color: #e9b96e;">"code"</span>, lang.types.integer, 1234)],
           <span style="color: #e9b96e;">"Open a door with a code, return true if successful"</span>)
</pre>
</div>

<p>
We also see that the beauty of a <code>method</code> is, at best, skin deep.
Except for the parts in <code>lang</code> which are target-language-specific, we
have no way to specify the "guts" of the method.  If there are any
guts to serve at all, it is up to the templates to do that carving.
</p>
</div>
</div>

<div id="outline-container-org9c2fda0" class="outline-3">
<h3 id="org9c2fda0"><span class="section-number-3">1.5</span> State Machine</h3>
<div class="outline-text-3" id="text-1-5">
<p>
The next model type is itself its own little world as moo has for
modeling (hierarchical) finite state machines (FSM - not flying
spaghetti monster).  If you do not know what FSMs are, go read
<a href="https://en.wikipedia.org/wiki/Finite-state_machine">wikipedia</a>.  Go on, I'll wait.
</p>

<p>
Back already?  Fascinating stuff, wasn't it.  As you learned, FSMs
have a few interrelated parts and thus their modeling requires a few
interrelated models.  
</p>

<p>
SM are important to the great protocol endpoint taxonomy that we
endeavor to one day define.  As programmers, we write SMs all the time
without knowing it.  On the street they are called "an ugly mess of
if/then/else and sometimes goto".  But in the pristine halls of
academia (if I was still allowed in) we come up with names for messes
and call it science.  So, "hierarchical finite state machine" it is.
And, in fairness, modeling the mess of branching we ultimately always
need gives us an excellent way to disentangle that mess and approach
something that might resemble beauty.
</p>

<p>
In moo we already know all the models we need to construct a model of
an FSM.  Here are the
</p>

<dl class="org-dl">
<dt>event</dt><dd><code>object</code></dd>
<dt>guard</dt><dd><code>method</code> (returning boolean)</dd>
<dt>action</dt><dd><code>method</code> (returning null)</dd>
<dt>state</dt><dd><code>object</code> (likely devoid of attributes)</dd>
<dt>transition</dt><dd>two states and optional event, guards and actions</dd>
<dt>context</dt><dd><code>object</code> some contextual data accessible to guards and actions and the larger context calling the state machine</dd>
<dt>machine</dt><dd><code>object</code> with at least one attribute named <code>tt</code> holding array of transitions and a <code>context</code> attribute.  A machine may also be used where a state is used and that's what lets us use the fancy word "hierarchical".</dd>
</dl>


<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> moo = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> lang = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo/cpp.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> string = lang.types.string;
<span style="color: #b4fa70;">local</span> boolean = lang.types.boolean;
<span style="color: #73d216;">// </span><span style="color: #73d216;">events</span>
<span style="color: #b4fa70;">local</span> start = moo.object(<span style="color: #e9b96e;">"start"</span>, [moo.attribute(<span style="color: #e9b96e;">"greeting"</span>, string, <span style="color: #e9b96e;">'""'</span>)]);
<span style="color: #b4fa70;">local</span> quit = moo.object(<span style="color: #e9b96e;">"quit"</span>);
<span style="color: #73d216;">// </span><span style="color: #73d216;">states</span>
<span style="color: #b4fa70;">local</span> ini = moo.object(<span style="color: #e9b96e;">"initializing"</span>);
<span style="color: #b4fa70;">local</span> wrk = moo.object(<span style="color: #e9b96e;">"working"</span>);
<span style="color: #b4fa70;">local</span> fin = moo.object(<span style="color: #e9b96e;">"finalizing"</span>);
<span style="color: #73d216;">// </span><span style="color: #73d216;">guards</span>
<span style="color: #b4fa70;">local</span> awake = moo.method(<span style="color: #e9b96e;">"check_awake"</span>, boolean, <span style="color: #e9b2e3;">false</span>);
<span style="color: #b4fa70;">local</span> happy = moo.method(<span style="color: #e9b96e;">"check_happy"</span>, boolean, <span style="color: #e9b2e3;">false</span>);
<span style="color: #73d216;">// </span><span style="color: #73d216;">actions</span>
<span style="color: #b4fa70;">local</span> dowork = moo.method(<span style="color: #e9b96e;">"dig_that_hole"</span>, lang.types.notype);
<span style="color: #73d216;">// </span><span style="color: #73d216;">transition table</span>
<span style="color: #b4fa70;">local</span> tt = [
    moo.transition(ini,wrk,start,[awake,happy],[dowork]),
    moo.transition(wrk,fin,quit)
];
<span style="color: #b4fa70;">local</span> ctx = moo.object(<span style="color: #e9b96e;">"gear"</span>, [ moo.attribute(<span style="color: #e9b96e;">"lunch"</span>, string, <span style="color: #e9b96e;">'"sandwich"'</span>),
                                 moo.attribute(<span style="color: #e9b96e;">"tool"</span>, string, <span style="color: #e9b96e;">'"hammer"'</span>) ]);
<span style="color: #b4fa70;">local</span> worksm = moo.object(<span style="color: #e9b96e;">"work"</span>, [ moo.attribute(<span style="color: #e9b96e;">"tt"</span>, tt),
                                    moo.attribute(<span style="color: #e9b96e;">"context"</span>, ctx) ]);
worksm
</pre>
</div>

<p>
Modeling FSMs in moo requires embracing some caveats.  Ultimately the
FSM implementation depends on how the template interprets the model.
This is true for all moo models and templates but it's extra true for
FSMs.  The FSM model may turn into a nest of <code>if/then/else</code> branches or
the use of the <code>tt</code> may turn into a literal lookup into a transition
table.  The instance of the <code>context</code> model may be explicitly passed
into guards and actions or it may be "global".  In a likewise or
different fashion the current event instance may be made available to
these methods.  When we model the FSM we must know what data can be
shared between the FSM parts but the model doesn't specify how it is
shared, or even that it is shared, the template does.  
</p>

<p>
This unfortunately produces a conceptual cycle between the model and
the template.  Your humble author apologizes but I squeak a defense
that to further specify the FSM in the model would limit how it may be
implemented to the extent that the model would hold implementation
code and break my promise that modeling does not require programming.
</p>
</div>
</div>
