zprotoc/jsonnet/README.org
** Command

We now start to get out of the low level world of navel gathering on
basic data structures and up our game to begin navel gathering on the
mythical "protocol endpoint taxonomy".

One of the most basic protocols is a back and maybe a forth exchange
between two entities.  I tell you to jump, you say how high.  Or,
maybe you simply ignore me.  Or, maybe you laugh in my face.  However
it may play out, moo calls this exchange a "command" and we model it
with a ~command~.

A command models something very much like a method.  You call an
instance of a method and that may return you value.  The ~name~ and
~arguments~ to a ~command~ instance may form an ~object~ and we will think
of that ~object~ as modeling a message sent to the other endpoint.

That part is easy.  It's always easier to shout into the abyss.  It's
harder to know what to do with the abyss answers.  Many types of
messages may come back and we'd like to model the behavior the command
enacts as a reaction.  Thankfully we just spent a section talking
about how to model behavior and so we will use an FSM model.

Lastly, we have that return value to deal with.  At most the ~command~
model can give the type and default value for the return.  The
template may collude with the model of the actions of the FSM to
effect a return or throw an exception.

This again brings us dangerously close to actual programming while it
was promised by moo (or rather by me) that we will slipped those
shackles.  It's also getting dangerously close to smashing layers
which someone recently claimed to hate.  Nonetheless we will try to stay true to our word.

Let's start by seeing how to construct a command model.

#+begin_src jsonnet
  local met = moo.method("open",...);
  local sm = moo.machine( ... );
  moo.command(met, sm, "Tell someone to open a door")
#+end_src

Well, that looks simple.  I see a method.  I know what that is.  I see
what looks like a help string.  That's nice and friendly.  And, I see
an FSM model.  No worries.

** Endpoint 

An endpoint there means one end if a protocol conversation and
~endpoint~ models it.  The "point" of an endpoint should be considered
to live in isolation only reacting to input by producing output.

** API

An API models a number of commands that govern a captive endpoint.
For example, an API template may generate an API class which
application will instantiate and through its methods it will send
command messages into an endpoint FSM and get back responses.  That
FSM may also be handling messages from the cosmos.



* Templates

In moo, templates are files in some nominal format but with extra
template markup sprinkled around.  When a template compiler applies a
data structure a new file in the nominal format is generated.  There
are many template systems and you can use different ones while still
using moo models.

But, in moo we'll focus on Jinja2 templates.  There are many ways to
use Jinja2 to apply data to templates but we will stick with the
simplicity of using the ~j2~ command line program.  You can install it
from PyPI like:

#+begin_example
  $ pip install j2cli
#+end_example

** Getting started

Before we get "serious" let's look at a trivial example.  First, a C++
template file:

#+include: examples/hello-types.hpp.j2 src c++

And a simple model file:

#+include: examples/hello-types.jsonnet src jsonnet

We compile the template against the model with ~j2~ and get a C++ file
out:

#+begin_src shell :exports both :results output code :wrap "SRC c++"
  j2 -f json examples/hello-types.hpp.j2 <(jsonnet -J . examples/hello-types.jsonnet) | clang-format
#+end_src

#+RESULTS:
#+begin_SRC c++
/*
 ,* Known types:
 ,*
 ,* - boolean
 ,* - integer
 ,* - notype
 ,* - string
 ,*/

#ifndef HELLO_MYTYPE
#define HELLO_MYTYPE

namespace hello {

    struct MyType {
        int x = 0;
        std::string s = "";
    };

    void to_json(json& j, const person& p) { j = json{{"x", p.x}, {"s", p.s}}; }

    void from_json(const json& j, person& p) {
        j.at("x").get_to(p.x);
        j.at("s").get_to(p.s);
    }
}  // namespace hello
#endif
#+end_SRC

It's possible to fuss over the Jinja2 templates in order to get
formatting just the way you like it.  For C++ it may be simpler to let
~clang-format~ to that work.  For the rest of this section we will walk
through some of the batteries-included templates provided by moo.

