moo/jsonnet/README.html

<div id="outline-container-orgbfdcd74" class="outline-3">
<h3 id="orgbfdcd74"><span class="section-number-3">1.6</span> Command</h3>
<div class="outline-text-3" id="text-1-6">
<p>
We now start to get out of the low level world of navel gathering on
basic data structures and up our game to begin navel gathering on the
mythical "protocol endpoint taxonomy".
</p>

<p>
One of the most basic protocols is a back and maybe a forth exchange
between two entities.  I tell you to jump, you say how high.  Or,
maybe you simply ignore me.  Or, maybe you laugh in my face.  However
it may play out, moo calls this exchange a "command" and we model it
with a <code>command</code>.
</p>

<p>
A command models something very much like a method.  You call an
instance of a method and that may return you value.  The <code>name</code> and
<code>arguments</code> to a <code>command</code> instance may form an <code>object</code> and we will think
of that <code>object</code> as modeling a message sent to the other endpoint.
</p>

<p>
That part is easy.  It's always easier to shout into the abyss.  It's
harder to know what to do with the abyss answers.  Many types of
messages may come back and we'd like to model the behavior the command
enacts as a reaction.  Thankfully we just spent a section talking
about how to model behavior and so we will use an FSM model.
</p>

<p>
Lastly, we have that return value to deal with.  At most the <code>command</code>
model can give the type and default value for the return.  The
template may collude with the model of the actions of the FSM to
effect a return or throw an exception.
</p>

<p>
This again brings us dangerously close to actual programming while it
was promised by moo (or rather by me) that we will slipped those
shackles.  It's also getting dangerously close to smashing layers
which someone recently claimed to hate.  Nonetheless we will try to stay true to our word.
</p>

<p>
Let's start by seeing how to construct a command model.
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> met = moo.method(<span style="color: #e9b96e;">"open"</span>,...);
<span style="color: #b4fa70;">local</span> sm = moo.machine( ... );
moo.command(met, sm, <span style="color: #e9b96e;">"Tell someone to open a door"</span>)
</pre>
</div>

<p>
Well, that looks simple.  I see a method.  I know what that is.  I see
what looks like a help string.  That's nice and friendly.  And, I see
an FSM model.  No worries.
</p>
</div>
</div>

<div id="outline-container-orgd2f4145" class="outline-3">
<h3 id="orgd2f4145"><span class="section-number-3">1.7</span> Endpoint</h3>
<div class="outline-text-3" id="text-1-7">
<p>
An endpoint there means one end if a protocol conversation and
<code>endpoint</code> models it.  The "point" of an endpoint should be considered
to live in isolation only reacting to input by producing output.
</p>
</div>
</div>

<div id="outline-container-orgb0499b8" class="outline-3">
<h3 id="orgb0499b8"><span class="section-number-3">1.8</span> API</h3>
<div class="outline-text-3" id="text-1-8">
<p>
An API models a number of commands that govern a captive endpoint.
For example, an API template may generate an API class which
application will instantiate and through its methods it will send
command messages into an endpoint FSM and get back responses.  That
FSM may also be handling messages from the cosmos.
</p>
</div>
</div>
</div>



<div id="outline-container-orgaf3ccfb" class="outline-2">
<h2 id="orgaf3ccfb"><span class="section-number-2">2</span> Templates</h2>
<div class="outline-text-2" id="text-2">
<p>
In moo, templates are files in some nominal format but with extra
template markup sprinkled around.  When a template compiler applies a
data structure a new file in the nominal format is generated.  There
are many template systems and you can use different ones while still
using moo models.
</p>

<p>
But, in moo we'll focus on Jinja2 templates.  There are many ways to
use Jinja2 to apply data to templates but we will stick with the
simplicity of using the <code>j2</code> command line program.  You can install it
from PyPI like:
</p>

<pre class="example">
$ pip install j2cli
</pre>
</div>

<div id="outline-container-org1047c52" class="outline-3">
<h3 id="org1047c52"><span class="section-number-3">2.1</span> Getting started</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Before we get "serious" let's look at a trivial example.  First, a C++
template file:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">/*</span>
<span style="color: #73d216;"> * Known types:</span>
<span style="color: #73d216;"> * {% for type in types %}</span>
<span style="color: #73d216;"> * - {{ type }}{% endfor %}</span>
<span style="color: #73d216;"> */</span>

<span style="color: #e090d7;">#if</span><span style="color: #e090d7;">n</span><span style="color: #e090d7;">def</span> {{<span style="color: #b4fa70;">namespace</span>|upper}}_{{obj.name|upper}}
<span style="color: #e090d7;">#define</span> {{<span style="color: #b4fa70;">namespace</span>|upper}}_{{obj.name|upper}}

<span style="color: #b4fa70;">namespace</span> {{<span style="color: #b4fa70;">namespace</span>}} {

<span style="color: #b4fa70;">struct</span> {{obj.name}} {
    {% <span style="color: #b4fa70;">for</span> attr in obj.attrs -%}
    {{attr.type}} {{attr.name}} = {{attr.def}};
    {% endfor -%}
};

<span style="color: #8cc4ff;">void</span> <span style="color: #fce94f;">to_json</span>(<span style="color: #8cc4ff;">json</span>&amp; <span style="color: #fcaf3e;">j</span>, <span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">person</span>&amp; <span style="color: #fcaf3e;">p</span>) {
    j = json{
        {%- <span style="color: #b4fa70;">for</span> attr in obj.attrs -%}
        {<span style="color: #e9b96e;">"{{attr.name}}"</span>, p.{{attr.name}}}{{ <span style="color: #e9b96e;">","</span> <span style="color: #b4fa70;">if</span> <span style="color: #b4fa70;">not</span> loop.last }}
        {%- endfor -%}
    };
}

<span style="color: #8cc4ff;">void</span> <span style="color: #fce94f;">from_json</span>(<span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">json</span>&amp; <span style="color: #fcaf3e;">j</span>, <span style="color: #8cc4ff;">person</span>&amp; <span style="color: #fcaf3e;">p</span>) {
    {% <span style="color: #b4fa70;">for</span> attr in obj.attrs -%}
    j.at(<span style="color: #e9b96e;">"{{attr.name}}"</span>).get_to(p.{{attr.name}});
    {% endfor -%}
}
}
<span style="color: #e090d7;">#endif</span>
</pre>
</div>

<p>
And a simple model file:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> moo = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> lang = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo/cpp.jsonnet"</span>;
{
    types: lang.types,
    namespace: <span style="color: #e9b96e;">"hello"</span>,
    obj: moo.object(<span style="color: #e9b96e;">"MyType"</span>,[
        moo.attribute(<span style="color: #e9b96e;">"x"</span>,lang.types.integer,0),
        moo.attribute(<span style="color: #e9b96e;">"s"</span>,lang.types.string,<span style="color: #e9b96e;">'""'</span>)]),
}
</pre>
</div>

<p>
We compile the template against the model with <code>j2</code> like:
</p>

<div class="org-src-container">
<pre class="src src-shell">j2 -f json examples/hello-types.hpp.j2 &lt;(jsonnet -J . examples/hello-types.jsonnet) | clang-format
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">/*</span>
<span style="color: #73d216;"> * Known types:</span>
<span style="color: #73d216;"> *</span>
<span style="color: #73d216;"> * - boolean</span>
<span style="color: #73d216;"> * - integer</span>
<span style="color: #73d216;"> * - notype</span>
<span style="color: #73d216;"> * - string</span>
<span style="color: #73d216;"> */</span>

<span style="color: #e090d7;">#if</span><span style="color: #e090d7;">n</span><span style="color: #e090d7;">def</span> HELLO_MYTYPE
<span style="color: #e090d7;">#define</span> <span style="color: #fcaf3e;">HELLO_MYTYPE</span>

<span style="color: #b4fa70;">namespace</span> <span style="color: #e9b2e3;">hello</span> {

    <span style="color: #b4fa70;">struct</span> <span style="color: #8cc4ff;">MyType</span> {
        <span style="color: #8cc4ff;">int</span> <span style="color: #fcaf3e;">x</span> = 0;
        <span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">string</span> <span style="color: #fcaf3e;">s</span> = <span style="color: #e9b96e;">""</span>;
    };

    <span style="color: #8cc4ff;">void</span> <span style="color: #fce94f;">to_json</span>(<span style="color: #8cc4ff;">json</span>&amp; <span style="color: #fcaf3e;">j</span>, <span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">person</span>&amp; <span style="color: #fcaf3e;">p</span>) { j = json{{<span style="color: #e9b96e;">"x"</span>, p.x}, {<span style="color: #e9b96e;">"s"</span>, p.s}}; }

    <span style="color: #8cc4ff;">void</span> <span style="color: #fce94f;">from_json</span>(<span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">json</span>&amp; <span style="color: #fcaf3e;">j</span>, <span style="color: #8cc4ff;">person</span>&amp; <span style="color: #fcaf3e;">p</span>) {
        j.at(<span style="color: #e9b96e;">"x"</span>).get_to(p.x);
        j.at(<span style="color: #e9b96e;">"s"</span>).get_to(p.s);
    }
}  <span style="color: #73d216;">// </span><span style="color: #73d216;">namespace hello</span>
<span style="color: #e090d7;">#endif</span>
</pre>
</div>

<p>
It's possible to fuss over the Jinja2 templates in order to get
formatting just the way you like it.  For C++ it may be simpler to let
<code>clang-format</code> to that work.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brett Viren</p>
<p class="date">Created: 2020-04-30 Thu 15:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
